nicx519y/Stellar-Dash/dongle/src/ch585_usbhs_device_sdkpatch.c
/********************************** (C) COPYRIGHT *******************************
* File Name          : ch585_usbhs_device.c
* Author             : WCH
* Version            : V1.0.0
* Date               : 2024/07/31
* Description        : This file provides all the USBHS firmware functions.
*********************************************************************************
* Copyright (c) 2024 Nanjing Qinheng Microelectronics Co., Ltd.
* Attention: This software (modified or not) and binary are used for
* microcontroller manufactured by Nanjing Qinheng Microelectronics.
*******************************************************************************/

#include <ch585_usbhs_device.h>
#include "usb_desc.h"
#include "usbd_compatibility_hid.h"

extern const uint8_t MyXsm3Info[];

/******************************************************************************/
/* Variable Definition */
/* test mode */
volatile uint8_t  USBHS_Test_Flag;
__attribute__ ((aligned(4))) uint8_t IFTest_Buf[ 53 ] =
{
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0xAA, 0xAA, 0xAA, 0xAA, 0xAA, 0xAA, 0xAA, 0xAA,
    0xEE, 0xEE, 0xEE, 0xEE, 0xEE, 0xEE, 0xEE, 0xEE,
    0xFE,//26
    0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,//37
    0x7F, 0xBF, 0xDF, 0xEF, 0xF7, 0xFB, 0xFD,//44
    0xFC, 0x7E, 0xBF, 0xDF, 0xEF, 0xF7, 0xFB, 0xFD, 0x7E//53
};

/* Global */
const uint8_t    *pUSBHS_Descr;

/* Setup Request */
volatile uint8_t  USBHS_SetupReqCode;
volatile uint8_t  USBHS_SetupReqType;
volatile uint16_t USBHS_SetupReqValue;
volatile uint16_t USBHS_SetupReqIndex;
volatile uint16_t USBHS_SetupReqLen;

/* USB Device Status */
volatile uint8_t  USBHS_DevConfig;
volatile uint8_t  USBHS_DevAddr;
volatile uint16_t USBHS_DevMaxPackLen;
volatile uint8_t  USBHS_DevSpeed;
volatile uint8_t  USBHS_DevSleepStatus;
volatile uint8_t  USBHS_DevEnumStatus;

/* HID Class Command */
volatile uint8_t USBHS_HidIdle;
volatile uint8_t USBHS_HidProtocol;
volatile uint16_t Hid_Report_Ptr;

/* Endpoint Buffer */
__attribute__ ((aligned(4))) uint8_t USBHS_EP0_Buf[ DEF_USBD_UEP0_SIZE ];
__attribute__ ((aligned(4))) uint8_t USBHS_EP1_Rx_Buf[ DEF_USBD_HS_PACK_SIZE ];
__attribute__ ((aligned(4))) uint8_t USBHS_EP2_Tx_Buf[ DEF_USBD_HS_PACK_SIZE ];
__attribute__ ((aligned(4))) uint8_t USBHS_EP3_Tx_Buf[ DEF_USBD_HS_PACK_SIZE ];
__attribute__ ((aligned(4))) uint8_t USBHS_EP4_Rx_Buf[ DEF_USBD_HS_PACK_SIZE ];
__attribute__ ((aligned(4))) uint8_t USBHS_EP5_Tx_Buf[ DEF_USBD_HS_PACK_SIZE ];

/* Endpoint tx busy flag */
volatile uint8_t  USBHS_Endp_Busy[ DEF_UEP_NUM ];

/* Microsoft OS descriptor hooks used by XInput-compatible binding on Windows. */
#define MS_OS_STRING_INDEX            0xEEu
#define MS_VENDOR_CODE                0x20u
#define MS_OS_DESC_COMPAT_ID_INDEX    0x0004u
#define MS_OS_DESC_EXT_PROP_INDEX     0x0005u
#define XINPUT_TELEMETRY_REPORT_DESC_LEN 21u

static const uint8_t s_ms_os_string_desc[] = {
    0x12u, 0x03u, 'M', 0x00u, 'S', 0x00u, 'F', 0x00u, 'T', 0x00u,
    '1', 0x00u, '0', 0x00u, '0', 0x00u, MS_VENDOR_CODE, 0x00u
};

static const uint8_t s_ms_compat_id_desc[] = {
    0x28u, 0x00u, 0x00u, 0x00u, /* dwLength = 40 */
    0x00u, 0x01u,               /* bcdVersion = 1.00 */
    0x04u, 0x00u,               /* wIndex = 0x0004 */
    0x01u,                      /* bCount */
    0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, /* reserved */
    0x00u,                      /* bFirstInterfaceNumber */
    0x01u,                      /* reserved */
    'X', 'U', 'S', 'B', '1', '0', 0x00u, 0x00u,       /* compatibleID */
    0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, /* subCompatibleID */
    0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u          /* reserved */
};

/* Minimal Extended Properties descriptor (no properties). */
static const uint8_t s_ms_ext_prop_desc[] = {
    0x0Au, 0x00u, 0x00u, 0x00u, /* dwLength = 10 */
    0x00u, 0x01u,               /* bcdVersion = 1.00 */
    0x05u, 0x00u,               /* wIndex = 0x0005 */
    0x00u, 0x00u                /* wCount = 0 */
};

/* 115200-8N1 default line coding for CDC ACM. */
static uint8_t s_cdc_line_coding[7] = {0x00u, 0xC2u, 0x01u, 0x00u, 0x00u, 0x00u, 0x08u};

/*********************************************************************
 * @fn      USB_TestMode_Deal
 *
 * @brief   Eye Diagram Test Function Processing.
 *
 * @return  none
 *
 */
void USB_TestMode_Deal( void )
{
#if TEST_ENABLE==0x01
    /* start test */
    USBHS_Test_Flag &= ~0x80;

    if( USBHS_SetupReqIndex == 0x0100 )
    {
        /* Test_J */
        R8_USB2_TEST_MODE &= ~TEST_MASK;
        R8_USB2_TEST_MODE |= USBHS_UD_TEST_J;
    }
    else if( USBHS_SetupReqIndex == 0x0200 )
    {
        /* Test_K */
        R8_USB2_TEST_MODE &= ~TEST_MASK;
        R8_USB2_TEST_MODE |= USBHS_UD_TEST_K;
    }
    else if( USBHS_SetupReqIndex == 0x0300 )
    {
        /* Test_SE0_NAK */
        R8_USB2_TEST_MODE &= ~TEST_MASK;
        R8_USB2_TEST_MODE |= USBHS_UD_TEST_SE0NAK;
    }
    else if( USBHS_SetupReqIndex == 0x0400 )
    {
        /* Test_Packet */
        R8_USB2_TEST_MODE &= ~TEST_MASK;

        R32_U2EP4_TX_DMA = (uint32_t)(&IFTest_Buf[ 0 ]);
        R16_U2EP4_T_LEN = 53;
        R8_U2EP4_TX_CTRL = USBHS_UEP_T_RES_ACK;
        R8_USB2_TEST_MODE |= USBHS_UD_TEST_PKT;
    }
    R8_USB2_TEST_MODE |= USBHS_UD_TEST_EN;
#endif
}

/*********************************************************************
 * @fn      USBHS_Device_Endp_Init
 *
 * @brief   Initializes USB device endpoints.
 *
 * @return  none
 */
void USBHS_Device_Endp_Init ( void )
{
    uint8_t i = 0;

    R16_U2EP_TX_EN = RB_EP0_EN | RB_EP2_EN | RB_EP3_EN | RB_EP5_EN;
    R16_U2EP_RX_EN = RB_EP0_EN | RB_EP1_EN | RB_EP4_EN;

    R32_U2EP0_MAX_LEN  = DEF_USBD_UEP0_SIZE;
    R32_U2EP1_MAX_LEN  = DEF_USB_EP1_HS_SIZE;
    R32_U2EP2_MAX_LEN  = DEF_USB_EP2_HS_SIZE;
    R32_U2EP3_MAX_LEN  = DEF_USB_EP3_HS_SIZE;
    R32_U2EP4_MAX_LEN  = DEF_USB_EP4_HS_SIZE;
    R32_U2EP5_MAX_LEN  = DEF_USB_EP5_HS_SIZE;

    R32_U2EP0_DMA    = (uint32_t)(uint8_t *)USBHS_EP0_Buf;
    R32_U2EP1_RX_DMA = (uint32_t)(uint8_t *)USBHS_EP1_Rx_Buf;
    R32_U2EP2_TX_DMA = (uint32_t)(uint8_t *)USBHS_EP2_Tx_Buf;
    R32_U2EP3_TX_DMA = (uint32_t)(uint8_t *)USBHS_EP3_Tx_Buf;
    R32_U2EP4_RX_DMA = (uint32_t)(uint8_t *)USBHS_EP4_Rx_Buf;
    R32_U2EP5_TX_DMA = (uint32_t)(uint8_t *)USBHS_EP5_Tx_Buf;

    R8_U2EP0_TX_CTRL = USBHS_UEP_T_RES_NAK;
    R8_U2EP0_RX_CTRL = USBHS_UEP_R_RES_ACK;
    R8_U2EP1_RX_CTRL = USBHS_UEP_R_RES_ACK;
    R8_U2EP2_TX_CTRL = USBHS_UEP_T_RES_NAK;
    R8_U2EP3_TX_CTRL = USBHS_UEP_T_RES_NAK;
    R8_U2EP4_RX_CTRL = USBHS_UEP_R_RES_ACK;
    R8_U2EP5_TX_CTRL = USBHS_UEP_T_RES_NAK;

