nicx519y/Stellar-Dash/dongle/src/ch585_usbhs_device_sdkpatch.c
    /* Clear End-points Busy Status */
    for( i=0; i < DEF_UEP_NUM; i++ )
    {
        USBHS_Endp_Busy[ i ] = 0;
    }
}

/*********************************************************************
 * @fn      USBHS_Device_Init
 *
 * @brief   Initializes USB high-speed device.
 *
 * @return  none
 */
void USBHS_Device_Init ( FunctionalState sta )
{
    if( sta )
    {
        R8_USBHS_PLL_CTRL = USBHS_PLL_EN;
        R16_PIN_CONFIG |= RB_PIN_USB2_EN;

        R8_USB2_CTRL = USBHS_UD_RST_LINK | USBHS_UD_PHY_SUSPENDM;
        R8_USB2_INT_EN = USBHS_UDIE_BUS_RST | USBHS_UDIE_SUSPEND | USBHS_UDIE_BUS_SLEEP | USBHS_UDIE_LPM_ACT | USBHS_UDIE_TRANSFER | USBHS_UDIE_LINK_RDY;
        USBHS_Device_Endp_Init();
        R8_USB2_BASE_MODE = USBHS_UD_SPEED_HIGH;
        R8_USB2_CTRL = USBHS_UD_DEV_EN | USBHS_UD_DMA_EN | USBHS_UD_LPM_EN | USBHS_UD_PHY_SUSPENDM;
        PFIC_EnableIRQ( USB2_DEVICE_IRQn );
    }
    else
    {
        R8_USBHS_PLL_CTRL &= ~USBHS_PLL_EN;
        R32_PIN_CONFIG &= ~RB_PIN_USB2_EN;

        R8_USB2_CTRL |= USBHS_UD_RST_SIE;
        R8_USB2_CTRL &= ~USBHS_UD_RST_SIE;
        PFIC_DisableIRQ( USB2_DEVICE_IRQn );
    }
}

/*********************************************************************
 * @fn      USBHS_Endp_DataUp
 *
 * @brief   usbhd-hs device data upload
 *          input: endp  - end-point numbers
 *                 *pubf - data buffer
 *                 len   - load data length
 *                 mod   - 0: DEF_UEP_DMA_LOAD 1: DEF_UEP_CPY_LOAD
 *
 * @return  none
 */
uint8_t USBHS_Endp_DataUp( uint8_t endp, uint8_t *pbuf, uint16_t len, uint8_t mod )
{
    uint8_t endp_en;

    /* DMA config, endp_ctrl config, endp_len config */
    if( (endp>=DEF_UEP1) && (endp<=DEF_UEP15) )
    {
        endp_en =  R16_U2EP_TX_EN;
        if( endp_en & USBHSD_UEP_TX_EN( endp ) )
        {
            if( (USBHS_Endp_Busy[ endp ] & DEF_UEP_BUSY) == 0x00 )
            {
                /* end-point buffer mode is single buffer */
                if( mod == DEF_UEP_DMA_LOAD )
                {
                    USBHSD_UEP_TXDMA( endp ) = (uint32_t)pbuf;
                }
                else if( mod == DEF_UEP_CPY_LOAD )
                {
                    memcpy( USBHSD_UEP_TXBUF(endp), pbuf, len );
                }
                else
                {
                    return 1;
                }

                /* Set end-point busy */
                USBHS_Endp_Busy[ endp ] |= DEF_UEP_BUSY;
                /* end-point n response tx ack */
                USBHSD_UEP_TLEN( endp ) = len;
                USBHSD_UEP_TXCTRL( endp ) = (USBHSD_UEP_TXCTRL( endp ) &= ~USBHS_UEP_T_RES_MASK) | USBHS_UEP_T_RES_ACK;
            }
            else
            {
                return 1;
            }
        }
        else
        {
            return 1;
        }
    }
    else
    {
        return 1;
    }

    return 0;
}

/*********************************************************************
 * @fn      USBHS_IRQHandler
 *
 * @brief   This function handles USBHS exception.
 *
 * @return  none
 */
__INTERRUPT
__HIGH_CODE
void USB2_DEVICE_IRQHandler( void )
{
    uint8_t  intflag, intst, errflag;
    uint16_t len;
    uint8_t endp_num;

    intflag = R8_USB2_INT_FG;
    intst = R8_USB2_INT_ST;

    if( intflag & USBHS_UDIF_TRANSFER )
    {
        endp_num = intst & USBHS_UDIS_EP_ID_MASK;
        if( !(intst & USBHS_UDIS_EP_DIR )) // SETUP/OUT Transaction
        {
            switch( endp_num )
            {
                case   DEF_UEP0:
                    if( R8_U2EP0_RX_CTRL & USBHS_UEP_R_SETUP_IS )
                    {
                        /* Store All Setup Values */
                        USBHS_SetupReqType  = pUSBHS_SetupReqPak->bRequestType;
                        USBHS_SetupReqCode  = pUSBHS_SetupReqPak->bRequest;
                        USBHS_SetupReqLen   = pUSBHS_SetupReqPak->wLength;
                        USBHS_SetupReqValue = pUSBHS_SetupReqPak->wValue;
                        USBHS_SetupReqIndex = pUSBHS_SetupReqPak->wIndex;

                        len = 0;
                        errflag = 0;
                        if ( ( USBHS_SetupReqType & USB_REQ_TYP_MASK ) != USB_REQ_TYP_STANDARD )
                        {
                            /* usb non-standard request processing */
                            if (( USBHS_SetupReqType & USB_REQ_TYP_MASK ) == USB_REQ_TYP_CLASS)
                              {
                                switch( USBHS_SetupReqCode )
                                {
                                    case CDC_GET_LINE_CODING:
                                        len = 7u;
                                        memcpy(USBHS_EP0_Buf, s_cdc_line_coding, len);
                                        break;

                                    case CDC_SET_LINE_CODING:
                                    case CDC_SET_LINE_CTLSTE:
                                    case CDC_SEND_BREAK:
                                        len = 0u;
                                        break;

                                    case HID_SET_REPORT:                            /* 0x09: SET_REPORT */
                                        Hid_Report_Ptr = 0;
                                        break;

                                    case HID_GET_REPORT:                            /* 0x01: GET_REPORT */
                                        Hid_Report_Ptr = 0;
                                        len = (USBHS_SetupReqLen >= DEF_USBD_UEP0_SIZE) ? DEF_USBD_UEP0_SIZE : USBHS_SetupReqLen;
                                        memset(USBHS_EP0_Buf, 0, len);
                                        break;

                                    case HID_SET_IDLE:                              /* 0x0A: SET_IDLE */
                                        USBHS_HidIdle = (uint8_t)( USBHS_SetupReqValue >> 8 );
                                        break;

                                    case HID_SET_PROTOCOL:                          /* 0x0B: SET_PROTOCOL */
                                        USBHS_HidProtocol = (uint8_t)USBHS_SetupReqValue;
                                        break;

