nicx519y/Stellar-Dash/dongle/src/ch585_usbhs_device_sdkpatch.c
                                    case HID_GET_IDLE:                              /* 0x02: GET_IDLE */
                                        USBHS_EP0_Buf[ 0 ] = USBHS_HidIdle;
                                        len = 1;
                                        break;

                                    case HID_GET_PROTOCOL:                          /* 0x03: GET_PROTOCOL */
                                        USBHS_EP0_Buf[ 0 ] = USBHS_HidProtocol;
                                        len = 1;
                                        break;
                                    default:
                                        /*
                                         * XInput host stacks may issue vendor/class probes.
                                         * Ack unknown class requests with ZLP instead of STALL.
                                         */
                                        len = 0;
                                        break;
                                }
                              }
                            else if (( USBHS_SetupReqType & USB_REQ_TYP_MASK ) == USB_REQ_TYP_VENDOR)
                            {
                                if (((USBHS_SetupReqType & DEF_UEP_IN) != 0u) &&
                                    (USBHS_SetupReqCode == MS_VENDOR_CODE) &&
                                    (USBHS_SetupReqIndex == MS_OS_DESC_COMPAT_ID_INDEX))
                                {
                                    pUSBHS_Descr = s_ms_compat_id_desc;
                                    len = (uint16_t)sizeof(s_ms_compat_id_desc);
                                    if( USBHS_SetupReqLen > len )
                                    {
                                        USBHS_SetupReqLen = len;
                                    }
                                    len = (USBHS_SetupReqLen >= DEF_USBD_UEP0_SIZE) ? DEF_USBD_UEP0_SIZE : USBHS_SetupReqLen;
                                    memcpy( USBHS_EP0_Buf, pUSBHS_Descr, len );
                                    pUSBHS_Descr += len;
                                }
                                else if (((USBHS_SetupReqType & DEF_UEP_IN) != 0u) &&
                                         (USBHS_SetupReqCode == MS_VENDOR_CODE) &&
                                         (USBHS_SetupReqIndex == MS_OS_DESC_EXT_PROP_INDEX))
                                {
                                    pUSBHS_Descr = s_ms_ext_prop_desc;
                                    len = (uint16_t)sizeof(s_ms_ext_prop_desc);
                                    if( USBHS_SetupReqLen > len )
                                    {
                                        USBHS_SetupReqLen = len;
                                    }
                                    len = (USBHS_SetupReqLen >= DEF_USBD_UEP0_SIZE) ? DEF_USBD_UEP0_SIZE : USBHS_SetupReqLen;
                                    memcpy( USBHS_EP0_Buf, pUSBHS_Descr, len );
                                    pUSBHS_Descr += len;
                                }
                                else
                                {
                                    /*
                                     * Avoid early enumeration failure on vendor probes:
                                     * return zero-filled IN data or ZLP for OUT.
                                     */
                                    if(( USBHS_SetupReqType & DEF_UEP_IN ) != 0u)
                                    {
                                        len = (USBHS_SetupReqLen >= DEF_USBD_UEP0_SIZE) ? DEF_USBD_UEP0_SIZE : USBHS_SetupReqLen;
                                        memset(USBHS_EP0_Buf, 0, len);
                                    }
                                }
                            }
                            else
                            {
                                if(( USBHS_SetupReqType & DEF_UEP_IN ) != 0u)
                                {
                                    len = (USBHS_SetupReqLen >= DEF_USBD_UEP0_SIZE) ? DEF_USBD_UEP0_SIZE : USBHS_SetupReqLen;
                                    memset(USBHS_EP0_Buf, 0, len);
                                }
                            }
                        }
                        else
                        {
                            /* usb standard request processing */
                            switch( USBHS_SetupReqCode )
                            {
                                /* get device/configuration/string/report/... descriptors */
                                case USB_GET_DESCRIPTOR:
                                    switch( (uint8_t)(USBHS_SetupReqValue>>8) )
                                    {
                                        /* get usb device descriptor */
                                        case USB_DESCR_TYP_DEVICE:
                                            pUSBHS_Descr = MyDevDescr;
                                            len = DEF_USBD_DEVICE_DESC_LEN;
                                            break;

                                        /* get usb configuration descriptor */
                                        case USB_DESCR_TYP_CONFIG:
                                            /* Query current usb speed */
                                            if( R8_USB2_MIS_ST & USBHS_UDMS_HS_MOD )
                                            {
                                                /* High speed mode */
                                                USBHS_DevSpeed = USBHS_SPEED_HIGH;
                                                USBHS_DevMaxPackLen = DEF_USBD_HS_PACK_SIZE;
                                                Head_Pack_Len = 2;
                                                Data_Pack_Max_Len = DEF_USBD_HS_PACK_SIZE - Head_Pack_Len;
                                            }
                                            else
                                            {
                                                /* Full speed mode */
                                                USBHS_DevSpeed = USBHS_SPEED_FULL;
                                                USBHS_DevMaxPackLen = DEF_USBD_FS_PACK_SIZE;
                                                Head_Pack_Len = 1;
                                                Data_Pack_Max_Len = DEF_USBD_FS_PACK_SIZE - Head_Pack_Len;
                                            }

