nicx519y/Stellar-Dash/dongle/src/ch585_usbhs_device_sdkpatch.c
                                /* Clear or disable one usb feature */
                                case USB_CLEAR_FEATURE:
                                    if( ( USBHS_SetupReqType & USB_REQ_RECIP_MASK ) == USB_REQ_RECIP_DEVICE )
                                    {
                                        /* clear one device feature */
                                        if((uint8_t)(USBHS_SetupReqValue&0xFF) == 0x01)
                                        {
                                            /* clear usb sleep status, device not prepare to sleep */
                                            USBHS_DevSleepStatus &= ~0x01;
                                        }
                                        else
                                        {
                                            errflag = 0xFF;
                                        }
                                    }
                                    else if ( ( USBHS_SetupReqType & USB_REQ_RECIP_MASK ) == USB_REQ_RECIP_ENDP )
                                    {
                                        /* Set End-point Feature */
                                        if( (uint8_t)(USBHS_SetupReqValue&0xFF) == USB_REQ_FEAT_ENDP_HALT )
                                        {
                                            /* Clear End-point Feature */
                                            switch( (uint8_t)(USBHS_SetupReqIndex&0xFF) )
                                            {
                                                case (DEF_UEP1 | DEF_UEP_OUT):
                                                        /* Set End-point 2 OUT ACK */
                                                        R8_U2EP1_RX_CTRL = USBHS_UEP_R_RES_ACK;
                                                    break;

                                                case (DEF_UEP1 | DEF_UEP_IN):
                                                        /* Set End-point 2 IN NAK */
                                                        R8_U2EP1_TX_CTRL = USBHS_UEP_T_RES_NAK;
                                                    break;

                                                case (DEF_UEP3 | DEF_UEP_OUT):
                                                        /* Set End-point 3 OUT ACK */
                                                        R8_U2EP3_RX_CTRL = USBHS_UEP_R_RES_ACK;
                                                    break;

                                                case (DEF_UEP4 | DEF_UEP_IN):
                                                        /* Set End-point 4 IN NAK */
                                                        R8_U2EP4_TX_CTRL = USBHS_UEP_T_RES_NAK;
                                                    break;

                                                case (DEF_UEP5 | DEF_UEP_OUT):
                                                        /* Set End-point 5 OUT ACK */
                                                        R8_U2EP5_RX_CTRL = USBHS_UEP_R_RES_ACK;
                                                    break;

                                                case (DEF_UEP6 | DEF_UEP_IN):
                                                        /* Set End-point 6 IN NAK */
                                                        R8_U2EP6_TX_CTRL = USBHS_UEP_T_RES_NAK;
                                                    break;

                                                default:
                                                    errflag = 0xFF;
                                                    break;
                                            }
                                        }
                                        else
                                        {
                                            errflag = 0xFF;
                                        }
                                    }
                                    else
                                    {
                                        errflag = 0xFF;
                                    }
                                    break;

                                /* set or enable one usb feature */
                                case USB_SET_FEATURE:
                                    if( ( USBHS_SetupReqType & USB_REQ_RECIP_MASK ) == USB_REQ_RECIP_DEVICE )
                                    {
                                        /* Set Device Feature */
                                        if( (uint8_t)(USBHS_SetupReqValue&0xFF) == USB_REQ_FEAT_REMOTE_WAKEUP )
                                        {
                                            if (((USBHS_DevSpeed == USBHS_SPEED_HIGH) && (MyCfgDescr_HS[7] & 0x20)) ||
                                                ((USBHS_DevSpeed == USBHS_SPEED_FULL) && (MyCfgDescr_FS[7] & 0x20)))
                                            {
                                                /* Set Wake-up flag, device prepare to sleep */
                                                USBHS_DevSleepStatus |= 0x01;
                                            }
                                            else
                                            {
                                                errflag = 0xFF;
                                            }
                                        }
                                        else if( (uint8_t)(USBHS_SetupReqValue&0xFF) == 0x02 )
                                        {
                                            /* test mode deal */
                                            if( ( USBHS_SetupReqIndex == 0x0100 ) ||
                                                ( USBHS_SetupReqIndex == 0x0200 ) ||
                                                ( USBHS_SetupReqIndex == 0x0300 ) ||
                                                ( USBHS_SetupReqIndex == 0x0400 ) )
                                            {
                                                /* Set the flag and wait for the status to be uploaded before proceeding with the actual operation */
                                                USBHS_Test_Flag |= 0x80;
                                            }
                                        }
                                        else
                                        {
                                            errflag = 0xFF;
                                        }
                                    }
                                    else if( ( USBHS_SetupReqType & USB_REQ_RECIP_MASK ) == USB_REQ_RECIP_ENDP )
                                    {
                                        /* Set End-point Feature */
                                        if( (uint8_t)(USBHS_SetupReqValue&0xFF) == USB_REQ_FEAT_ENDP_HALT )
                                        {
                                            /* Set end-points status stall */
                                            switch((uint8_t)(USBHS_SetupReqIndex&0xFF) )
                                            {
                                                case (DEF_UEP1 | DEF_UEP_OUT):
                                                        /* Set End-point 1 OUT STALL */
                                                        R8_U2EP1_RX_CTRL = ( R8_U2EP1_RX_CTRL & ~USBHS_UEP_R_RES_MASK ) | USBHS_UEP_R_RES_STALL;
                                                    break;

