nicx519y/Stellar-Dash/dongle/src/ch585_usbhs_device_sdkpatch.c
                                                case (DEF_UEP1 | DEF_UEP_IN):
                                                    /* Set End-point 1 IN STALL */
                                                        R8_U2EP1_TX_CTRL = ( R8_U2EP1_TX_CTRL & ~USBHS_UEP_T_RES_MASK ) | USBHS_UEP_T_RES_STALL;
                                                    break;

                                                case (DEF_UEP3 | DEF_UEP_OUT):
                                                        /* Set End-point 3 OUT STALL */
                                                        R8_U2EP3_RX_CTRL = ( R8_U2EP3_RX_CTRL & ~USBHS_UEP_R_RES_MASK ) | USBHS_UEP_R_RES_STALL;
                                                    break;

                                                case (DEF_UEP4 | DEF_UEP_IN):
                                                        /* Set End-point 4 IN STALL */
                                                        R8_U2EP4_TX_CTRL = ( R8_U2EP4_TX_CTRL & ~USBHS_UEP_T_RES_MASK ) | USBHS_UEP_T_RES_STALL;
                                                    break;

                                                case (DEF_UEP5 | DEF_UEP_OUT):
                                                        /* Set End-point 5 OUT STALL */
                                                        R8_U2EP5_RX_CTRL = ( R8_U2EP5_RX_CTRL & ~USBHS_UEP_R_RES_MASK ) | USBHS_UEP_R_RES_STALL;
                                                    break;

                                                case (DEF_UEP6 | DEF_UEP_IN):
                                                        /* Set End-point 6 IN STALL */
                                                        R8_U2EP6_TX_CTRL = ( R8_U2EP6_TX_CTRL & ~USBHS_UEP_T_RES_MASK ) | USBHS_UEP_T_RES_STALL;
                                                    break;

                                                default:
                                                    errflag = 0xFF;
                                                    break;
                                            }
                                        }
                                    }
                                    break;

                                /* This request allows the host to select another setting for the specified interface  */
                                case USB_GET_INTERFACE:
                                    USBHS_EP0_Buf[0] = 0x00;
                                    if ( USBHS_SetupReqLen > 1 )
                                    {
                                        USBHS_SetupReqLen = 1;
                                    }
                                    break;

                                case USB_SET_INTERFACE:
                                    break;

                                /* host get status of specified device/interface/end-points */
                                case USB_GET_STATUS:
                                    USBHS_EP0_Buf[0] = 0x00;
                                    USBHS_EP0_Buf[1] = 0x00;
                                    if( ( USBHS_SetupReqType & USB_REQ_RECIP_MASK ) == USB_REQ_RECIP_ENDP )
                                    {
                                        switch( (uint8_t)( USBHS_SetupReqIndex & 0xFF ) )
                                        {
                                            case (DEF_UEP1 | DEF_UEP_OUT):
                                                 if( ( (R8_U2EP1_RX_CTRL) & USBHS_UEP_R_RES_MASK ) == USBHS_UEP_R_RES_STALL )
                                                 {
                                                     USBHS_EP0_Buf[ 0 ] = 0x01;
                                                 }

                                            case (DEF_UEP1 | DEF_UEP_IN):
                                                if( ( (R8_U2EP1_TX_CTRL) & USBHS_UEP_T_RES_MASK ) == USBHS_UEP_T_RES_STALL )
                                                {
                                                    USBHS_EP0_Buf[ 0 ] = 0x01;
                                                }
                                                break;

                                            case (DEF_UEP2 | DEF_UEP_IN):
                                                if( ( (R8_U2EP2_TX_CTRL) & USBHS_UEP_T_RES_MASK ) == USBHS_UEP_T_RES_STALL )
                                                {
                                                    USBHS_EP0_Buf[ 0 ] = 0x01;
                                                }
                                                break;

                                            case (DEF_UEP3 | DEF_UEP_OUT):
                                                 if( ( (R8_U2EP3_RX_CTRL) & USBHS_UEP_R_RES_MASK ) == USBHS_UEP_R_RES_STALL )
                                                 {
                                                     USBHS_EP0_Buf[ 0 ] = 0x01;
                                                 }
                                                 break;

                                            case (DEF_UEP4 | DEF_UEP_IN):
                                                if( ( (R8_U2EP4_TX_CTRL) & USBHS_UEP_T_RES_MASK ) == USBHS_UEP_T_RES_STALL )
                                                {
                                                    USBHS_EP0_Buf[ 0 ] = 0x01;
                                                }
                                                break;

                                            case (DEF_UEP5 | DEF_UEP_OUT):
                                                if( ( (R8_U2EP5_RX_CTRL) & USBHS_UEP_R_RES_MASK ) == USBHS_UEP_R_RES_STALL )
                                                {
                                                    USBHS_EP0_Buf[ 0 ] = 0x01;
                                                }
                                                break;

                                            case (DEF_UEP6 | DEF_UEP_IN):
                                                if( ( (R8_U2EP6_TX_CTRL) & USBHS_UEP_T_RES_MASK ) == USBHS_UEP_T_RES_STALL )
                                                {
                                                    USBHS_EP0_Buf[ 0 ] = 0x01;
                                                }
                                                break;

                                            default:
                                                 errflag = 0xFF;
                                                 break;
                                        }
                                    }
                                    else if( ( USBHS_SetupReqType & USB_REQ_RECIP_MASK ) == USB_REQ_RECIP_DEVICE )
                                    {
                                          if( USBHS_DevSleepStatus & 0x01 )
                                          {
                                              USBHS_EP0_Buf[ 0 ] = 0x02;
                                          }
                                    }

                                    if ( USBHS_SetupReqLen > 2 )
                                    {
                                        USBHS_SetupReqLen = 2;
                                    }
                                    break;

                                default:
                                    errflag = 0xFF;
                                    break;
                            }
                        }

