nicx519y/Stellar-Dash/dongle/src/ch585_usbhs_device_sdkpatch.c
                    /* test mode */
                    if( USBHS_Test_Flag & 0x80 )
                    {
                        USB_TestMode_Deal( );
                    }
                    R8_U2EP0_TX_CTRL &= ~USBHS_UEP_T_DONE;
                    break;

                /* end-point 2 data in interrupt */
                case DEF_UEP2:
                    R16_U2EP2_T_LEN = 0;
                    R8_U2EP2_TX_CTRL ^= USBHS_UEP_T_TOG_DATA1;
                    R8_U2EP2_TX_CTRL = (R8_U2EP2_TX_CTRL & ~USBHS_UEP_T_RES_MASK) | USBHS_UEP_T_RES_NAK;
                    USBHS_Endp_Busy[ DEF_UEP2 ] &= ~DEF_UEP_BUSY;
                    UploadPoint_Busy = 0;

                    R8_U2EP2_TX_CTRL &= ~USBHS_UEP_T_DONE;
                    break;
                case DEF_UEP3:
                    R16_U2EP3_T_LEN = 0;
                    R8_U2EP3_TX_CTRL ^= USBHS_UEP_T_TOG_DATA1;
                    R8_U2EP3_TX_CTRL = (R8_U2EP3_TX_CTRL & ~USBHS_UEP_T_RES_MASK) | USBHS_UEP_T_RES_NAK;
                    USBHS_Endp_Busy[ DEF_UEP3 ] &= ~DEF_UEP_BUSY;
                    R8_U2EP3_TX_CTRL &= ~USBHS_UEP_T_DONE;
                    break;
                case DEF_UEP5:
                    R16_U2EP5_T_LEN = 0;
                    R8_U2EP5_TX_CTRL ^= USBHS_UEP_T_TOG_DATA1;
                    R8_U2EP5_TX_CTRL = (R8_U2EP5_TX_CTRL & ~USBHS_UEP_T_RES_MASK) | USBHS_UEP_T_RES_NAK;
                    USBHS_Endp_Busy[ DEF_UEP5 ] &= ~DEF_UEP_BUSY;
                    R8_U2EP5_TX_CTRL &= ~USBHS_UEP_T_DONE;
                    break;
                default :
                    break;
            }

        }
    }

    else if( intflag & USBHS_UDIF_LINK_RDY )
    {

#ifdef  SUPPORT_USB_HSI

            USB_HSI->CAL_CR |= HSI_CAL_EN | HSI_CAL_VLD;
            USB_HSI->CAL_CR &= ~HSI_CAL_RST;

#endif
            R8_USB2_INT_FG = USBHS_UDIF_LINK_RDY;

    }
    else if( intflag & USBHS_UDIF_SUSPEND )
    {
        R8_USB2_INT_FG = USBHS_UDIF_SUSPEND;
        /* usb suspend interrupt processing */
        if ( R8_USB2_MIS_ST & RB_UMS_SUSPEND  )
        {
            USBHS_DevSleepStatus |= 0x02;
            if( USBHS_DevSleepStatus == 0x03 )
            {
                /* Handling usb sleep here */
            }
        }
        else
        {
            USBHS_DevSleepStatus &= ~0x02;
        }

    }
    else if( intflag & USBHS_UDIF_BUS_RST )
    {
        /* usb reset interrupt processing */
        USBHS_DevConfig = 0;
        USBHS_DevAddr = 0;
        USBHS_DevSleepStatus = 0;
        USBHS_DevEnumStatus = 0;

        R8_USB2_DEV_AD = 0;
        USBHS_Device_Endp_Init( );
        R8_USB2_INT_FG = USBHS_UDIF_BUS_RST;
    }
    else
    {
        /* other interrupts */
        R8_USB2_INT_FG = intflag;
    }
}
